Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: A pointer advanced from this pointer by MemoryLayout<Pointee>.stride bytes.
ja: このポインタからMemoryLayout<Pointee>.strideバイトだけ繰り上げられるポインタを返します。

source: A pointer for accessing and manipulating data of a specific type.
ja: ある特定の型のデータにアクセスおよび操作するためのポインタ。

source: A pointer for accessing data of a specific type.
ja: ある特定の型の日付にアクセスするためのボインタ。

source: A pointer offset from this pointer by n instances of the Pointee type.
ja: このポインタからn個のPointee型のインスタンス分だけ補われたポインタ。

source: A pointer shifted backward from this pointer by MemoryLayout<Pointee>.stride bytes.
ja: このポインタから後ろへMemoryLayout<Pointee>.strideバイトだけずらされるポインタを返します。

source: A pointer to a newly allocated region of memory.
ja: 新しくアロケートされたメモリ領域へのポインタ。

source: A pointer to a null-terminated UTF-8 code sequence.
ja: ヌル終端のコードシーケンスへのポインタ。

source: A pointer to a null-terminated code sequence encoded in encoding.
ja: encodingでエンコードされたヌル終端のコードシーケンスへのポインタ。

source: A pointer to a null-terminated sequence of UTF-8 code units.
ja: あるnull終端された一連のUTF-8コード単位へのあるポインタ。

source: A pointer to a sequence of contiguous code units in the encoding specified in sourceEncoding, ending just before the first zero code unit.
ja: sourceEncodingで指定のエンコーディングでの、最初のゼロコード単位の直前で終わっている隣接コード単位シーケンスへのポインタ。

source: A pointer to a sequence of contiguous, UTF-8 encoded bytes ending just before the first zero byte.
ja: 最初のゼロバイト直前で終わっている、隣接の、UTF-8エンコードされた幾らかのバイトに対するポインタ。

source: A pointer to at least count initialized instances of type Pointee.
ja: 少なくともcount個の初期化された型Pointeeのインスタンスに対するポインタ。

source: A pointer to the first byte of the buffer.
ja: バッファへの最初のバイトへのポインタ。

source: A pointer to the first element of the buffer.
ja: このバッファの最初の要素へのポインタ。

source: A pointer to the memory to copy bytes from.
ja: そこからバイトをコピーすることになるメモリへのポインタ。

source: A pointer to the start of the buffer, or nil.
ja: バッファの始まりへのポインタ、またはnil。

source: A pointer to the values to copy.
ja: コピーされる値に対するポインタ。

source: A position in a String or one of its views.
ja: あるStringまたはそれのビューの１つの中のある位置。

source: A position in a view of the target parameter.
ja: targetパラメータのあるビューの中のある位置。

source: A position in at least one of the views of the string shared by target.
ja: targetによって共有される文字列のいくつかのビューのうち少なくとも１つにおけるある位置。

source: A position in the utf16 view of a string.
ja: ある文字列のutf16の中のある位置。

source: A position of a character or code unit in a string.
ja: 文字列の中のある文字またはコード単位の位置。

source: A possible prefix to test against this string.
ja: この文字列に対してテストすることになる可能性のある接頭辞。

source: A possible suffix to test against this string.
ja: この文字列に対してテストすることになる可能性のある接尾辞。

source: A predicate that returns true if its first argument should be ordered before its second argument; otherwise, false.
ja: ある述部、それはそれの最初の引数がそれの２番目の引数の前に並べられるべきならばtrueを返します；そうでなければ、false。

source: A predicate that returns true if its two arguments are equivalent; otherwise, false.
ja: ある述部、それはそれの２つの引数が等しいならばtrueを返します；そうでなければ、false。

source: A predicate used to partition the collection.
ja: コレクションに仕切りをするのに使われる述部。

source: A private-use character.
ja: 私用面の文字。

source: A punctuation mark of another type.
ja: 別の型の句読点符号。

source: A radix-2 (binary) floating-point type.
ja: あるradix-2（バイナリ）浮動小数点型。

source: A random element from the collection.
ja: このコレクションからのある無作為の要素。

source: A random value of T in the range 0..<upperBound.
ja: ある無作為なTの値で範囲0..<upperBoundの中のもの。

source: A random value of T.
ja: ある無作為なTの値。

source: A random value within the bounds of range.
ja: rangeの境界内のある無作為な値。

source: A range expression that represents the entire range of a collection.
ja: あるコレクションの全体の範囲を表す範囲式。

source: A range of the buffer’s indices.
ja: バッファのもつインデックスの範囲。

source: A range of the collection’s indices.
ja: コレクションのもつインデックスのある範囲。

source: A range-replaceable collection.
ja: 範囲置換可能なコレクション。

source: A raw pointer for accessing and manipulating untyped data.
ja: 型付けされないデータにアクセスおよび操作するための生のポインタ。

source: A raw pointer for accessing untyped data.
ja: 型付けされないデータにアクセスするための生のポインタ。

source: A raw pointer to the same address as this pointer.
ja: このポインタと同じアドレスに対する生のポインタ。

source: A representation of the string that is suitable for debugging.
ja: その文字列のひとつの表現、デバッグに適するもの。

source: A representation of the substructure and display style of an instance of any type.
ja: 下位構造体の表現と何らかの型のインスタンスの表示形式。

source: A representation of this integer with the byte order swapped.
ja: この整数のバイト順交換した表現。

source: A reserved unassigned code point or a non-character.
ja: 予約済み未割り当てコード点または非文字。

source: A sequence built around an iterator of type Base.
ja: 型Baseのイテレータに基づいて構築されるシーケンス。

source: A sequence consisting of all the elements contained in each segment contained in some Base sequence.
ja: 何らかのBaseシーケンスに含まれる各断片の中に含まれるいくらかの要素から成るシーケンス。

source: A sequence containing the same elements as a Base sequence, but on which some operations such as map and filter are implemented lazily.
ja: Baseシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence containing the same elements as this sequence, but on which some operations, such as map and filter, are implemented lazily.
ja: このシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence leaving off the specified number of elements.
ja: 指定された数の要素を取り除いたあるシーケンス。

source: A sequence of Unicode scalar values.
ja: ユニコードスカラー値のシーケンス。

source: A sequence of characters.
ja: いくつかの文字からなるシーケンス。

source: A sequence of elements with which to initialize the buffer.
ja: 幾らかの要素からなるシーケンス、それに対してバッファを初期化します。

source: A sequence of elements with which to initializer the buffer.
ja: いくらかの要素からなるシーケンス、それを使ってバッファを初期化します。

source: A sequence of pairs built out of two underlying sequences.
ja: ２つの根底にあるシーケンスから組み立てられるペアからなるシーケンス。

source: A sequence of pairs enumerating the sequence.
ja: このシーケンスを列挙している、ペアからなるあるシーケンス。

source: A sequence of the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素からなるあるシーケンス。

source: A sequence of values formed by striding over a closed interval.
ja: ある完結間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence of values formed by striding over a half-open interval.
ja: ある半開間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence on which normally-eager sequence operations are implemented lazily.
ja: あるシーケンス、それにおいては通常は先行な演算は、遅延に実装されます。

source: A sequence starting after the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素の後で始まるあるシーケンス。

source: A sequence starting after the specified number of elements.
ja: 指定された数の要素の後で始まるシーケンス。

source: A sequence starting at the beginning of this sequence with at most maxLength elements.
ja: このシーケンスの先端で始まる多くともmaxLength要素のあるシーケンス。

source: A sequence that lazily consumes and drops n elements from an underlying Base iterator before possibly returning the first available element.
ja: おそらくは最初の利用可能な要素が返る前にn個の要素をある基礎をなすBaseイテレータから遅延に消費して落とすあるシーケンス。

source: A sequence that only consumes up to n elements from an underlying Base iterator.
ja: 最大でn個の要素まで基礎をなすBaseイテレータからただ消費しきるあるシーケンス。

source: A sequence that presents the elements of a base sequence of sequences concatenated using a given separator.
ja: あるシーケンス、それはいくらかのシーケンスからなるある基盤となるシーケンスの要素らを、与えられた分離子を使って連結して提示します。

source: A sequence that represents a contiguous subrange of the collection’s elements.
ja: コレクションの要素の隣接下位範囲を表すシーケンス。

source: A sequence to compare to this sequence.
ja: あるシーケンス、このシーケンスと比べることになります。

source: A sequence to insert between each of this sequence’s elements.
ja: このシーケンスの要素それぞれの間に挿入されるシーケンス。

source: A sequence whose elements are produced via repeated applications of a closure to some mutable state.
ja: あるクロージャをある何らかの可変の状態へ繰り返し適用することでその要素が生み出されるシーケンス。

source: A sequence whose elements can be traversed multiple times, nondestructively, and accessed by an indexed subscript.
ja: あるシーケンス、それの要素は複数回探査されることが非破壊的に可能です、そしてある添え字で指し示すことによってアクセスされることが可能です。

source: A sequence whose elements consist of the elements of some base sequence that also satisfy a given predicate.
ja: あるシーケンス、それは何らかの基盤シーケンスの要素でさらにまた与えられた述部を満足させるものから成る要素たちです。

source: A sequence whose elements consist of the elements that follow the initial consecutive elements of some base sequence that satisfy a given predicate.
ja: あるシーケンス、それの要素は何らかの基盤シーケンスの、ある与えられた述部を満足させる最初の隣接要素の後に続く要素それらから成ります。

source: A sequence whose elements consist of the initial consecutive elements of some base sequence that satisfy a given predicate.
ja: あるシーケンス、それの要素は何かの基盤シーケンスのもので、与えられた述部を満足させる最初の連続した要素から成ります。

source: A service which can execute jobs.
ja: ジョブを遂行できるあるサービス。

source: A set of Unicode character values for use in search operations.
ja: 検索操作において使うための一揃いのユニコード文字値。

source: A shuffled array of this sequence’s elements.
ja: このシーケンスの持つ要素からなる、あるシャッフルされた配列。

source: A signed integer value type.
ja: 符号付き整数値型。

source: A single Unicode scalar value.
ja: ある単一のユニコードスカラー値。

source: A single extended grapheme cluster that approximates a user-perceived character.
ja: ある単一の拡張書記素クラスタで、１つのユーザ知覚文字におおよそ相当します。

source: A single string can have greatly differing lengths when measured by its different views.
ja: ある単一の文字列は、それの異なるビューによって測られる時に大きく違っていることがありえます。

source: A single, concatenated string.
ja: 単一の、連結された文字列。

source: A single, flattened asynchronous sequence that contains all elements in all the asychronous sequences produced by transform.
ja: ある単一の、平坦にされた非同期シーケンス、それはtransformによって生み出される全ての非同期シーケンスの中の全ての要素を含みます。

source: A single-precision, floating-point value type.
ja: 単精度、浮動小数点値型。

source: A singleton actor whose executor is equivalent to the main dispatch queue.
ja: あるシングルトンアクター、それのエグゼキュータはメインディスパッチキューと同等です。

source: A slice inherits the value or reference semantics of its base collection.
ja: スライスは、それの基盤コレクションのもつ値意味論もしくは参照意味論を継承します。

source: A slice may hold a reference to the entire storage of a larger collection, not just to the portion it presents, even after the base collection’s lifetime ends.
ja: あるスライスは、単にそれが提示する一部分に対してではなく、より大きなコレクションのストレージ全体への参照を保持します、元のコレクションの寿命が終わった後でさえも。

source: A slice of a string.
ja: ある文字列のスライス。

source: A slice stores a base collection and the start and end indices of the view.
ja: あるスライス（切り取り）は、基盤コレクションおよびビューの始まりと終わりのインデックスを格納します。

source: A sorted array of the sequence’s elements.
ja: このシーケンス要素のソート済み配列。

source: A source of text-streaming operations.
ja: テキストストリーミング操作のソース。

source: A space character of non-zero width.
ja: 非ゼロ幅の空白文字。

source: A spacing combining mark with positive advance width.
ja: 正の送り幅をもつ空白結合記号。

source: A stable sort preserves the relative order of elements for which areInIncreasingOrder does not establish an order.
ja: 安定ソートは、それに対してareInIncreasingOrderが順序を確立しない要素らの相対順序を保存します。

source: A stable sort preserves the relative order of elements that compare equal.
ja: 安定ソートは、等しいと比較される要素それらの相対順序を保存します。

source: A static string can use either of the following as its storage:
ja: 静的文字列は、以下のどちらかをそれのストレージとして使用できます：

source: A static, plain-text Unicode string object that bridges to String; use NSString when you need reference semantics or other Foundation-specific behavior.
ja: 静的な、プレーンテキストのユニコード文字列オブジェクト、それはStringにブリッジされます；あなたが参照意味論または他のFoundation特有の挙動を必要とする時はNSStringを使ってください。

source: A string instance or another sequence of characters.
ja: ある文字列インスタンスまたは別のいくらかの文字からなるシーケンス。

source: A string is a collection of extended grapheme clusters, which approximate human-readable characters.
ja: ある文字列は、拡張書記素クラスタのコレクションです、それらはだいたいは人間が読むことができる文字です。

source: A string is a series of characters, such as "Swift", that forms a collection.
ja: 文字列は一続きの文字です、例えば"Swift"など、それはあるコレクションを形成します。

source: A string literal containing the characters that appear next in the string literal.
ja: 次にこの文字列リテラルにおいて現れる文字を含んでいる文字列リテラル。

source: A string representation of the scalar.
ja: スカラーの文字列表現。

source: A string to append.
ja: 追加される文字列。

source: A string to insert between each of the elements in this sequence.
ja: このシーケンスの要素のそれぞれの間に挿入されることになる文字列。

source: A string type designed to represent text that is known at compile time.
ja: コンパイル時に知られるテキストを表現するために設計される文字列型。

source: A string value converts to an MLDataValue.ValueType.string.
ja: 文字列値は、MLDataValue.ValueType.stringに変わります。

source: A string’s unicodeScalars property is a collection of Unicode scalar values, the 21-bit codes that are the basic unit of Unicode.
ja: ある文字列のもつunicodeScalarsプロパティは、ユニコードの基本単位である21ビットコード、ユニコードスカラー値いくつかからなるコレクションです。

source: A string’s utf16 property is a collection of UTF-16 code units, the 16-bit encoding form of the string’s Unicode scalar values.
ja: ある文字列のもつutf16プロパティは、その文字列のもつユニコードスカラー値の16ビット符号化形式、UTF-16コード単位いくつかからなるコレクションです。

source: A string’s utf8 property is a collection of UTF-8 code units, the 8-bit encoding form of the string’s Unicode scalar values.
ja: ある文字列のもつutf8プロパティは、その文字列のもつユニコードスカラー値の８ビット符号化形式、UTF-８コード単位いくつかからなるコレクションです。

source: A string’s UTF-16 view encodes the string’s Unicode scalar values as 16-bit integers.
ja: 文字列のもつUTF-16ビューは、文字列のもつユニコードスカラー値を16ビット整数として符号化します。

source: A string’s UTF-8 view encodes the string’s Unicode scalar values as 8-bit integers.
ja: 文字列の持つUTF-8ビューは、文字列の持つユニコードスカラー値を8ビット整数として符号化します。

source: A string’s Unicode scalar values can be up to 21 bits in length.
ja: 文字列の持つユニコードスカラー値は、長さが21ビットに至るまで可能です。

source: A string’s data is only copied lazily, upon mutation, when more than one string instance is using the same buffer.
ja: １つ以上の文字列インスタンスが同じバッファを使っている時、変化において、ある文字列の持つデータは遅延にのみコピーされます。

source: A string’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 文字列の「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: A subsequence starting after the specified number of elements.
ja: 指定された数の要素の後から始まる下位シーケンス。

source: A subsequence starting at the start position.
ja: start位置から始まる下位シーケンス。

source: A subsequence starting at the beginning of this collection with at most maxLength elements.
ja: このコレクションの先端で始まる多くともmaxLength要素の下位シーケンス。

source: A subsequence terminating at the end of the collection with at most maxLength elements.
ja: コレクションの末端で終わっていて多くともmaxLengthの要素を持つ下位シーケンス。

source: A subsequence that leaves off k elements from the end.
ja: k個の要素を終わりから取り除いた下位シーケンス。

source: A subsequence that leaves off the specified number of elements at the end.
ja: 指定された数の要素が末尾から無くなっているシーケンス。

source: A subsequence up to, and including, the end position.
ja: end位置に至るまでの、そしてそれを含む、下位シーケンス。

source: A subsequence up to, but not including, the end position.
ja: end位置に至るまでの、しかしそれを含まないシーケンス。

source: A substring holds a reference to the entire storage of the string it comes from, not just to the portion it presents, even when there is no other reference to the original string.
ja: 下位文字列はそれが由来する文字列のストレージ全体への参照を保持します、それが存在する部分に対してだけではなく、たとえ本来の文字列への他の参照が存在しないときでさえも。

source: A substring to convert to a standalone String instance.
ja: ある下位文字列を独立したStringインスタンスに変換します。

source: A surrogate code point.
ja: あるサロケートコード点。

source: A symbol of another type.
ja: 別の型のシンボル。

source: A symbol of mathematical use.
ja: 数学的利用の記号。

source: A task can voluntarily suspend itself in the middle of a long-running operation that doesn’t contain any suspension points, to let other tasks run for a while before execution returns back to this task.
ja: あるタスクは、自発的にそれ自身を一時停止することが、どのような一時停止地点も含まないある長く動作する演算の最中に可能です、そうしてしばらく他のタスクに動作させます、遂行がこのタスクに戻る前に。

source: A task group must be used only within the task where it was created.
ja: タスクグループは。それが作成されたところのタスク内でのみ使われなければなりません。

source: A task group serves as storage for dynamically created child tasks.
ja: あるタスクグループ、それは動的に作成される子タスクそれらに対するストレージとして利用できます。

source: A task group serves as storage for dynamically created, potentially throwing, child tasks.
ja: あるタスクグループ、それは動的に作成される、潜在的にスローする、子タスクそれらに対するストレージとして利用できます。

source: A task-local value is a value that can be bound and read in the context of a Task.
ja: タスクローカルな値は、あるTaskの文脈においてバインド（束縛）および読み出しされることが可能な値です。

source: A task’s execution can be seen as a series of periods where the task ran.
ja: タスクのもつ遂行は、そこにおいてタスクが動作したところの一連の期間として見ることができます。

source: A textual description of the vector.
ja: ベクターのテキスト記述。

source: A textual representation of the Unicode scalar.
ja: ユニコードスカラーのテキスト表現。

source: A textual representation of the buffer, suitable for debugging.
ja: そのバッファのテキスト表現、デバッグに適するもの。

source: A textual representation of the pointer, suitable for debugging.
ja: そのポインタのテキスト表現、デバッグに適するもの。

source: A textual representation of the static string, suitable for debugging.
ja: 静的文字列のテキスト表現、デバッグに適するもの。

source: A textual representation of the static string.
ja: その静的文字列のテキスト表現。

source: A textual representation of this instance, suitable for debugging.
ja: そのインスタンスのテキスト表現、デバッグに適するもの。

source: A textual representation of this instance.
ja: このインスタンスのテキスト表現。

source: A textual representation of this value.
ja: この値のテキスト表現。

source: A trivial type can be copied with just a bit-for-bit copy without any indirection or reference-counting operations.
ja: 自明な型は、単にビット対ビットコピーでコピーされることが、何らかの間接的または参照カウント操作なしで可能です。

source: A true value.
ja: あるtrue値。

source: A tuple containing the high and low parts of a double-width integer.
ja: ２倍幅整数の高および低部分を含んでいるタプル。

source: A tuple containing the high and low parts of the result of multiplying this value and other.
ja: この値とotherを乗算する結果の高および低部分を含んでいるタプル。

source: A tuple containing the number of UTF-16 code units required to encode input and a Boolean value that indicates whether the input contained only ASCII characters.
ja: inputをエンコードするのに必要とされるUTF-16コード単位の数とinputがASCII文字だけを含んでいるかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the quotient and remainder of dividend divided by this value.
ja: dividendをこの値で除算した商と余りを含んでいるタプル。

source: A tuple containing the quotient and remainder of this value divided by rhs.
ja: rhsによって除算されたこの値の商と余りを含んでいるタプル。

source: A tuple containing the result of the addition along with a Boolean value indicating whether overflow occurred.
ja: 加算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the division along with a Boolean value indicating whether overflow occurred.
ja: 除算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the multiplication along with a Boolean value indicating whether overflow occurred.
ja: 乗算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the operation along with a Boolean value indicating whether overflow occurred.
ja: 演算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the subtraction along with a Boolean value indicating whether overflow occurred.
ja: 減算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple with the new string and a Boolean value that indicates whether any repairs were made.
ja: 新しい文字列と、あらゆる修復がなされたかどうかを指し示すブール値を持つタプル。

source: A type for propagating an unmanaged object reference.
ja: ある管理されないオブジェクト参照を伝達するための型。

source: A type representing an error value that can be thrown.
ja: スローされることが可能なあるエラー値を表している型。

source: A type representing continuous, one-dimensional values that can be offset and measured.
ja: オフセットできて計測できる、連続的な、一次元の値を表している型。

source: A type representing the sequence’s elements.
ja: このシーケンスの持つ要素を表している型。

source: A type that can be compared for value equality.
ja: 値の同等性について比較されることができる型。

source: A type that can be compared using the relational operators <, <=, >=, and >.
ja: 関係演算子<、<=、>=、そして>を使って比較されるある型。

source: A type that can be converted to and from an associated raw value.
ja: ある結び付けられた生の値へおよびそれから変換できる型。

source: A type that can be hashed into a Hasher to produce an integer hash value.
ja: Hasherへとハッシュ化されることで整数ハッシュ値を生成することが可能な型。

source: A type that can be initialized by string interpolation with a string literal that includes expressions.
ja: いくらかの式を含むある文字列リテラルを使う文字列補間によって初期化できる型。

source: A type that can be initialized using a dictionary literal.
ja: ある辞書リテラルを使って初期化できる型。

source: A type that can be initialized using an array literal.
ja: 配列リテラルを使って初期化できる型。

source: A type that can be initialized using the nil literal, nil.
ja: nilリテラル、nilを使って初期化できる型。

source: A type that can be initialized with a floating-point literal.
ja: ある浮動小数点リテラルを使って初期化できる型。

source: A type that can be initialized with a string literal containing a single Unicode scalar value.
ja: 単一のユニコードスカラー値を含んでいるある文字列リテラルで初期化できる型。

source: A type that can be initialized with a string literal containing a single extended grapheme cluster.
ja: ただ１つの拡張書記素クラスタを含んでいるある文字列リテラルを使って初期化できる型。

source: A type that can be initialized with a string literal.
ja: ある文字列リテラルを使って初期化できる型。

source: A type that can be initialized with an integer literal.
ja: 整数リテラルで初期化できるある型。

source: A type that can be initialized with the Boolean literals true and false.
ja: ブールリテラルのtrueとfalseを使って初期化できる型。

source: A type that can be represented as a string in a lossless, unambiguous way.
ja: あるロスレスの、曖昧さのない方法で、文字列として表現できる型。

source: A type that can be the target of text-streaming operations.
ja: テキストストリーミング操作のターゲットであることができる型。

source: A type that can be used as a key for encoding and decoding.
ja: エンコーディングとデコーディングのためのキーとして使われる型。

source: A type that can be used as an element in a SIMD vector.
ja: SIMDベクターにおける要素として使用できるある型。

source: A type that can be used to parse CodeUnits into EncodedScalars.
ja: ある型、それはCodeUnitsをEncodedScalarそれらへと構文解析するのに使用可能なものです。

source: A type that can be used to parse a reversed sequence of CodeUnits into EncodedScalars.
ja: ある型、それはCodeUnitsの逆の並びをEncodedScalarそれらへと構文解析するのに使用可能なものです。

source: A type that can be used to slice a collection.
ja: コレクションをスライスするために使われる型。

source: A type that can convert itself into and out of an external representation.
ja: それ自身を外部表現へとそしてそれをもとに変換できる型。

source: A type that can decode itself from an external representation.
ja: それ自身が外部表現からデコードできる型。

source: A type that can decode values from a native format into in-memory representations.
ja: 値をネイティブ形式からインメモリ表現へとデコードできる型。

source: A type that can encode itself to an external representation.
ja: それ自身を外部表現へとエンコードできる型。

source: A type that can encode values into a native format for external representation.
ja: 値を外部表現のためにネイティブ形式へとエンコードできる型。

source: A type that can function as storage for a SIMD vector type.
ja: ある型、それは、SIMDベクター型に対するストレージとして機能できるものです。

source: A type that can represent a string as a collection of characters.
ja: 文字列を文字のコレクションとして表すことができる型。

source: A type that can represent both positive and negative values.
ja: 正と負の値の両方を表せる型。

source: A type that can represent the absolute value of any possible value of this type.
ja: この型の何らかの可能な値の絶対値を表すことのできる型。

source: A type that conforms to RangeReplaceableCollection can choose how to respond when this method is called.
ja: RangeReplaceableCollectionに準拠する型は、このメソッドが呼ばれた時どのような応答をするか選ぶことができます。

source: A type that explicitly supplies its own mirror, but whose descendant classes are not represented in the mirror unless they also override customMirror.
ja: 明示的にそれ独自のMirrorを提供するある型、しかしそれの子孫クラスはそれらがまたcustomMirrorをオーバーライドしない限りはMirrorで表現されません。

source: A type that explicitly supplies its own mirror.
ja: 明示的にそれ自身のMirrorを提供する型。

source: A type that iterates over a collection using its indices.
ja: あるコレクション全体に渡ってそれのインデックスを使って繰り返し処理する型。

source: A type that presents a mathematical set interface to a bit set.
ja: 数学的なセットインターフェイスをビットセットに与える型。

source: A type that provides a collection of all of its values.
ja: それの値の全てからなるコレクションを提供する型。

source: A type that provides a view into a decoder’s storage and is used to hold the encoded properties of a decodable type in a keyed manner.
ja: ある型で、あるデコーダの持つストレージへのビューを提供し、そしてデコーダ可能型のエンコードされたプロパティをキー流儀で保持するために使われます。

source: A type that provides a view into a decoder’s storage and is used to hold the encoded properties of a decodable type sequentially, without keys.
ja: ある型で、あるデコーダの持つストレージへのビューを提供し、そしてデコーダ可能型のエンコードされたプロパティを順次的に、キーなしで保持するために使われます。
